app/controllers/cocktails_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients"
---
  def show
    @dose = Dose.new
    @cocktail = Cocktail.find(params[:id])
    @ingredients = Ingredient.all

INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Friso's Fissa"], ["created_at", 2017-03-24 10:28:23 UTC], ["updated_at", 2017-03-24 10:28:23 UTC]]
---
  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save