app/controllers/doses_controller.rb

  def create
    @dose = Dose.new(dose_params)
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose.cocktail = @cocktail
    if @dose.save
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "doses" ("description", "cocktail_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "dasdad"], ["cocktail_id", 2], ["ingredient_id", 2], ["created_at", 2017-03-23 17:19:48 UTC], ["updated_at", 2017-03-23 17:19:48 UTC]]

    def destroy
      @dose = Dose.find(params[:id])
      @dose.destroy
---
SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 2]]